<?php

return [
    /*
    |--------------------------------------------------------------------------
    | رسائل التحقق العامة
    |--------------------------------------------------------------------------
    */
    'required' => 'حقل :attribute مطلوب ولا يمكن تركه فارغاً.',
    'unique'   => 'قيمة :attribute مستخدمة مسبقاً، يرجى اختيار قيمة أخرى.',
    'numeric'  => 'يجب أن يكون :attribute عبارة عن رقم.',
    'exists'   => ':attribute المختارة غير موجودة في سجلاتنا.',
    'boolean'  => 'يجب أن تكون قيمة :attribute إما صحيح أو خطأ.',
    'image'    => 'يجب أن يكون :attribute ملف صورة.',
    'max'      => [
        'numeric' => 'يجب أن لا يتجاوز :attribute :max.',
        'string'  => 'يجب أن لا يتجاوز :attribute :max حرفاً.',
        'file'    => 'حجم :attribute يجب أن لا يتجاوز :max كيلوبايت.',
    ],
    'min'      => [
        'numeric' => 'يجب أن يكون :attribute على الأقل :min.',
        'string'  => 'يجب أن لا تقل :attribute عن :min أحرف.',
        ],
        'confirmed' => 'تأكيد :attribute غير متطابق.',
        'string'    => 'يجب أن يكون :attribute نصاً.',

    /*
    |--------------------------------------------------------------------------
    | أسماء الحقول بالعربي
    |--------------------------------------------------------------------------
  */
    'attributes' => [
        'name' => 'الاسم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
       // 'fcm_token' => 'توكن الإشعارات',
    ],
];

    /*
    |--------------------------------------------------------------------------
    | رسائل التحقق الخاصة بالكورسات والدبلومات
    |--------------------------------------------------------------------------
    */
//     */
//     //كورسات
//     'attributes' => [
//         'code'          => 'كود الدورة',
//         'department_id' => 'القسم التابع له',
//         'title_ar'      => 'العنوان بالعربي',
//         'title_en'      => 'العنوان بالإنجليزي',
//         'name_ar'       => 'اسم الدورة بالعربي',
//         'name_en'       => 'اسم الدورة بالإنجليزي',
//         'description'   => 'الوصف',
//         'price'         => 'سعر الدورة',
//         'image'         => 'صورة الدورة',
//         'is_open'       => 'حالة القبول',
//         'is_active'     => 'حالة التفعيل',
//     ],
//     //دبلومات
//     'attributes' => [
//     // حقول مشتركة
//     'code'           => 'كود الدبلوم', // أو "الكود" ليعمل على الكل
//     'image'          => 'الصورة',
//     'is_open'        => 'حالة القبول',
//     'is_active'      => 'حالة التفعيل',

//     // حقول خاصة بالدبلوم
//     'institute_id'   => 'المعهد المختص',
//     'title_ar'       => 'العنوان بالعربي',
//     'title_en'       => 'العنوان بالإنجليزي',
//     'description_ar' => 'الوصف بالعربي',
//     'description_en' => 'الوصف بالإنجليزي',
//     'total_cost'     => 'إجمالي التكلفة',
//     'course_ids'     => 'الكورسات المختارة',
//     'course_ids.*'   => 'أحد الكورسات المختارة',
// ],
// ];
